'use strict';
const{createApp} = Vue;
createApp({
    data(){
        return {
            city: null,
            workshop: null,
            staff: null,
            time: null,
            city_options: [
                {text: 'Москва'},
                {text: 'Санкт-Петербург'},
                {text: 'Новосибирск'}
            ],
            workshop_options: {
                'Новосибирск': [
                    {ws: 'Основной'},
                    {ws: 'Обеспечивающий'},
                ],
                'Москва': [
                    {ws: 'Вспомогательный'},
                    {ws: 'Обслуживающий'}
                ],
                'Санкт-Петербург': [
                    {ws: 'Подсобный'},
                    {ws: 'Побочный'},
                ]
            },
            staff_option: {
                'Основной': ['Сотрудник 1', "Сотрудник 2"],
                'Обеспечивающий': ['Сотрудник 3', "Сотрудник 4"],
                'Вспомогательный': ['Сотрудник 5', "Сотрудник 6"],
                'Обслуживающий': ['Сотрудник 7', "Сотрудник 8"],
                'Подсобный': ['Сотрудник 9', "Сотрудник 10"],
                'Побочный': ['Сотрудник 11', "Сотрудник 12"],

            },
            time_options: [
                {interval: '8:00 - 20:00'},
                {interval: '20:00 - 8:00'}
            ],
            group_options: {
                '8:00 - 20:00': ['Бригада 1', 'Бригада 2'],
                '20:00 - 8:00': ['Бригада 3', 'Бригада 4']
            }
        };
    },
    methods: {
        setCookie(event) {
            document.cookie = event.target.name + "=" + event.target.value + ';max-age=' + 86400;
        }
    }
}).mount('#app');


